In [1]:
from bs4 import BeautifulSoup
import requests
import pandas as pd

In [2]:
url = "https://www.iplt20.com/news/3852/tata-ipl-2023-player-auction-list-announced"
page = requests.get(url)

In [3]:
soup = BeautifulSoup(page.text, 'html')

In [4]:
table = soup.find('table')
#table

In [5]:
titles = table.find_all('p')[1:8]
#titles

In [6]:
header = []
for t in titles:
    title = t.text
    header.append(title)

In [7]:
df = pd.DataFrame(columns = header)

In [8]:
df

Empty DataFrame
Columns: [Franchise, No of Players, No of Overseas Players, Total  money spent (Rs.), Salary cap available (Rs.), Available Slots, Overseas Slots]
Index: []

In [9]:
rows = table.find_all('tr')[2:]
#print

In [10]:
row = []

for r in rows:
    data = r.find_all('td')
    row = [d.text.strip() for d in data]
    
    l = len(df)
    df.loc[l] = row

In [11]:
df

,Franchise,No of Players,No of Overseas Players,Total money spent (Rs.),Salary cap available (Rs.),Available Slots,Overseas Slots
0,CSK,18,6,74.55,20.45,7,2
1,DC,20,6,75.55,19.45,5,2
2,GT,18,5,75.75,19.25,7,3
3,KKR,14,5,87.95,7.05,11,3
4,LSG,15,4,71.65,23.35,10,4
5,MI,16,5,74.45,20.55,9,3
6,PBKS,16,5,62.8,32.2,9,3
7,RCB,18,6,86.25,8.75,7,2
8,RR,16,4,81.8,13.2,9,4
9,SRH,12,4,52.75,42.25,13,4
10,Total,163,50,743.5,206.5,87,30

In [12]:
df.to_csv('TATA_IPL_23.csv')